Repository: LoperHuh/DiscordChatBot
Catalog: DiscordBot.BusinessLogic/Resources/CommandAction/Resources.*.resx
Languages: ru

# CBCommandDesc
source: CoffeeBracke command. Input time after command. Press to emoji below answer to be notified when the timer goes off.
ru: Команда на кофебрейк. После команды введите время. Нажмите на эмодзи под ответом бота чтобы быть уведомлены когда таймер сработает.

# CBCommandExample
source: Command example !cb 19:00
ru: Пример команды !cb 19:00

# CBInputError
source: Command entered without time.
ru: Команда отправлена без времени.

# ParsingError
source: Cant parse value
ru: Не получилось спарсить значение

# EchoCommandDesc
source: Bot test. Respond with text after command or "Hello" if command empty
ru: Тест бота. Возвращает сообщение после комманды или "Привет" если сообщение пусто.

# EchoDefaultResponse
source: Hello there
ru: Привет тебе

# SettingsSetTimeZone
source: Set timezone offset from utc
ru: Установить таймзону UTC

# SettingsSetTimeZoneExample
source: Command example for UTC +5 !SetTZ 5
ru: Пример команды для UTC +5 !SetTZ 5

# SettingsGetTimeZone
source: Get sever timezone
ru: Получить таймзону сервера

source: Applied
ru: Принято

# SettingsGetCurrentLocale
source: Get bot localization
ru: Получить локализацию бота

# SettingsSetCurrentLocale
source: Set bot localization
ru: Установить локализацию бота

# SettingsLocaleSettedtCurrentLocale
source: Locale setted
ru: Локаль установлена

# CBCommandTimerSetted
source: Timer will fire in {0} hours {1} minutes. Press emoji to get notified!
ru: Напомню о себе через {0} часов {1} минут. Проголосуй, если пойдешь

# CBCommandTimerIsDue
source: Its coffee break time! {0}
ru: Пора пить чай и проветривать помещение! {0}

# AIChatDescription
source: Send message to chat GPT (3.5)
ru: Отправить сообщение Чату жпт

# AIMessageSended
source: Await response...
ru: Ожидаем ответа...

# GenericError
source: Internal error encountered. You can try again
ru: Внутренняя ошибка при выполении команды. Обязательно починию. А пока, попробуй снова. Сообщение:

# context_length_exceeded
source: Context lenght exceeded for current model
ru: Превышена длинна контекста для текущей модели
